{
    "cours": [
        {
            "code": "CHE101",
            "title": "CHE101 - General Chemistry (2019-2020)",
            "category": "Bachelor 1",
            "summary": "Description CHE101 - General Chemistry (2019-2020)",
            "idnumber": "CHE101-2019"
        },
        {
            "code": "INF551",
            "title": "INF551 - Computational Logic: Artificial Intelligence to Zero Bugs (2019-2020)",
            "category": "Ingénieur 3A \/ Master 1",
            "summary": "INF551 - Computational Logic: Artificial Intelligence to Zero Bugs (2019-2020)",
            "idnumber": "INF551-2019"
        },
        {
            "code": "INF575",
            "title": "INF575 - Safe Intelligent Systems (2019-2020)",
            "category": "Ingénieur 3A \/ Master 1",
            "summary": "<p>L'interaction de composantes informatiques, qui calculent et communiquent, avec leur environnement régi par des lois physiques, comme pour un avion ou un système médical implanté, est au centre du domaine émergent des systèmes cyber-physiques. Parmi les défis posés par ces systèmes auxquels nous nous intéresserons, l'utilisation croissante d'algorithmes d'intelligence artificielle (réseaux de neurones typiquement), que ce soit pour la perception ou le contrôle.<\/p> <p>Maitriser la modélisation, le contrôle et la vérification du comportement de tels systèmes est crucial pour garantir l'efficacité, les fonctionnalités et la fiabilité de ces systèmes, toujours plus complexes et le plus souvent critiques en terme de sécurité ou de coût.<\/p> <p>Le cours s'attachera à trouver un équilibre entre modélisation et vérification, et entre fondations théoriques et les aspects pratiques. Il introduira notamment aux principes et à l'utilisation de quelques outils représentatifs de l'état de l'art, et s'intéressera à des cas d'étude réalistes (notamment un modèle temporel de pacemaker modélisé et vérifié avec l'outil Uppaal).<\/p> <p>Le cours est central aux thématiques de la filière Design of Intelligent Autonomous Systems, mais il est également naturel dans le parcours Electrical Engineering ou dans les filières The Internet of Everything for a Digitized Society (IOE4DS) ou Algorithms and Foundations of Programming Languages. Des sujets de projets 3A en lien avec des thématiques peuvent être proposés. <\/p> <p> <\/p> <p><strong>Contenu:<\/strong><\/p> <ol><li>Introduction, modèles et langages synchrones<\/li> <li>Langages synchrones: spécification et vérification<\/li> <li>Automates temporisés<\/li> <li>Logique temporelle et verification par model-checking <\/li> <li>Modélisation et simulation de systèmes hybrides<\/li> <li>Analyse d'atteignabilité de systèmes hybrides<\/li> <li>Stabilité et contrôle de systèmes hybrides<\/li> <li>Sureté des systèmes autonomes intelligents<\/li> <\/ol><p>Le cours est illustré par des exercices applicatifs (en cours), et par les séances de travaux pratiques utilisant différents outils de modélisation et vérification. Les quatre dernières séances sont dédiées à un projet, dans lequel l'accent pourra être mis, au choix des étudiants, sur la modélisation et vérification d'un système cyber-physique, ou sur l'étude plus poussée d'un aspect d'une méthode de vérification. <\/p> <p>Le cours sera validé pour une petite moitié sur les TPs, et la grosse moitié restante sur le projet et l'oral associé.<\/p> <p><strong>Langue d'enseignement <\/strong>:<\/p> <p>Les documents sont en anglais, les cours sont donnés en français par défaut, en anglais sur demande<\/p> <br \/><hr \/><br \/><p>L'interaction de composantes informatiques, qui calculent et communiquent, avec leur environnement régi par des lois physiques, comme pour un avion ou un système médical implanté, est au centre du domaine émergent des systèmes cyber-physiques. Parmi les défis posés par ces systèmes auxquels nous nous intéresserons, l'utilisation croissante d'algorithmes d'intelligence artificielle (réseaux de neurones typiquement), que ce soit pour la perception ou le contrôle.<\/p> <p>Maitriser la modélisation, le contrôle et la vérification du comportement de tels systèmes est crucial pour garantir l'efficacité, les fonctionnalités et la fiabilité de ces systèmes, toujours plus complexes et le plus souvent critiques en terme de sécurité ou de coût.<\/p> <p>Le cours s'attachera à trouver un équilibre entre modélisation et vérification, et entre fondations théoriques et les aspects pratiques. Il introduira notamment aux principes et à l'utilisation de quelques outils représentatifs de l'état de l'art, et s'intéressera à des cas d'étude réalistes (notamment un modèle temporel de pacemaker modélisé et vérifié avec l'outil Uppaal).<\/p> <p>Le cours est central aux thématiques de la filière Design of Intelligent Autonomous Systems, mais il est également naturel dans le parcours Electrical Engineering ou dans les filières The Internet of Everything for a Digitized Society (IOE4DS) ou Algorithms and Foundations of Programming Languages. Des sujets de projets 3A en lien avec des thématiques peuvent être proposés. <\/p> <p> <\/p> <p><strong>Contenu:<\/strong><\/p> <ol><li>Introduction, modèles et langages synchrones<\/li> <li>Langages synchrones: spécification et vérification<\/li> <li>Automates temporisés<\/li> <li>Logique temporelle et verification par model-checking <\/li> <li>Modélisation et simulation de systèmes hybrides<\/li> <li>Analyse d'atteignabilité de systèmes hybrides<\/li> <li>Stabilité et contrôle de systèmes hybrides<\/li> <li>Sureté des systèmes autonomes intelligents<\/li> <\/ol><p>Le cours est illustré par des exercices applicatifs (en cours), et par les séances de travaux pratiques utilisant différents outils de modélisation et vérification. Les quatre dernières séances sont dédiées à un projet, dans lequel l'accent pourra être mis, au choix des étudiants, sur la modélisation et vérification d'un système cyber-physique, ou sur l'étude plus poussée d'un aspect d'une méthode de vérification. <\/p> <p>Le cours sera validé pour une petite moitié sur les TPs, et la grosse moitié restante sur le projet et l'oral associé.<\/p> <p><strong>Langue d'enseignement <\/strong>:<\/p> <p>Les documents sont en anglais, les cours sont donnés en français par défaut, en anglais sur demande<\/p>",
            "idnumber": "INF575-2019"
        },
        {
            "code": "INF580",
            "title": "INF580 - Large scale mathematical optimization (2019-2020)",
            "category": "Ingénieur 3A \/ Master 1",
            "summary": "<p class=\"p1\">La programmation mathématique (PM) est un langage formel pour définir et resoudre un problème d'optimisation. Un programme mathématique est constitué de paramètres (l'input du problème), variables de décision (l'output), une ou plusieurs fonctions objectifs, et zéro ou plusieurs contraintes qui peuvent être données sous forme explicite ou implicite (par exemple, contraintes d'intégralité sur les variables). Les objectifs et les contraintes explicites sont éxprimés comme des fonctions des paramètres et des variables de décision. Il existe une grande variété de \"solveurs génériques\" pour les programmes mathématiques, de telle sorte qu'obtenir la solution du problème se réduit à soumettre le programme à un solveur. Ainsi, la PM réduit les difficultés algorithmiques de l'optimisation à des difficultés de modélisation.<\/p> <p class=\"p1\">La PM est fortement utilisée dans des milieux industriels: production, logistique, gestion des ressources (humaines, financières, énergétiques et autres), télécommunications, etc., ainsi que dans les milieux de l'Information Technology de pointe: Google, Microsoft, Yahoo, Huawei embauchent plusieurs chercheurs en PM, et IBM en hébèrge une équipe entière!<\/p> <p class=\"p1\">Ce paradigme de programmation donne lieu à une famille d'algorithmes complexes et puissants, qui incluent le calcul des solutions de problèmes d'optimisation (grâce à la PM) parmi leurs \"instructions élémentaires\". Celui-ci donne lieu à pratiquement toutes les approches en Machine Learning (ML) les plus modernes, du clustering jusqu'au traitement automatique du langage naturel. <\/p> <p class=\"p1\">Modalités d'évaluation: soit un projet, soit un examen oral.<\/p> <p class=\"p1\">Langue du cours: Français &amp; Anglais.<\/p> <p class=\"p1\">Credits ECTS: 4<\/p> <p class=\"p1\"> <\/p> <br \/><hr \/><br \/><p class=\"p1\" style=\"margin-top:0px;color:#212529;font-family:'-apple-system', 'system-ui', 'Segoe UI', Roboto, 'Helvetica Neue', Arial, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol';font-size:16px;text-align:justify;\">Mathematical Programming (MP) is a formal language for defining and solving optimization problems. A mathematical program consists of parameters (the input), decision variables (the output), one or more objective functions, and zero or more constraints given in either explicit or implicit (e.g. integrality constraints on the decision variables) form. Objectives and explicit constraints are expressed as functions of parameters adn variables. Mathematical programs can be passed to one of many existing \"generic solvers\", which provide the solution. Thus, MP shifts algorithmic and implementation difficulties in optimization to modelling issues.<\/p> <p class=\"p1\" style=\"margin-top:0px;color:#212529;font-family:'-apple-system', 'system-ui', 'Segoe UI', Roboto, 'Helvetica Neue', Arial, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol';font-size:16px;text-align:justify;\">MP is very much present in industry: production, logistics, resource management (whether the resources be human, financial, energetic or others), telecommunications, etc. MP can also be found in hi-tech IT firms: Google, Microsoft, Yahoo, Huawei currently employ many mathematical programmers. IBM actually has a whole MP team!<\/p> <p class=\"p1\" style=\"margin-top:0px;color:#212529;font-family:'-apple-system', 'system-ui', 'Segoe UI', Roboto, 'Helvetica Neue', Arial, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol';font-size:16px;text-align:justify;\">This programming paradigm gives rise to a family of complex and powerful algorithms, including the solution of whole optimization problems (by means of MP) as \"elementary steps\". This paradigm is at the basis of the vast majority of modern Machine Learning (ML) techniques, from clustering to natural language processing.<\/p> <p class=\"p1\" style=\"margin-top:0px;color:#212529;font-family:'-apple-system', 'system-ui', 'Segoe UI', Roboto, 'Helvetica Neue', Arial, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol';font-size:16px;text-align:justify;\">Course evaluation: either a project or an oral exam.<\/p> <p class=\"p1\" style=\"margin-top:0px;color:#212529;font-family:'-apple-system', 'system-ui', 'Segoe UI', Roboto, 'Helvetica Neue', Arial, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol';font-size:16px;text-align:justify;\">Language: French and English<\/p> <p class=\"p1\" style=\"margin-top:0px;color:#212529;font-family:'-apple-system', 'system-ui', 'Segoe UI', Roboto, 'Helvetica Neue', Arial, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol';font-size:16px;text-align:justify;\">ECTS Credits: 4<\/p>",
            "idnumber": "INF580-2019"
        },
        {
            "code": "MAT551",
            "title": "MAT551 - Systèmes dynamiques (2019-2020)",
            "category": "Ingénieur 3A \/ Master 1",
            "summary": "<p style=\"text-align:justify;\">Les systèmes dynamiques occupent une place déterminante dans les mathématiques comme dans leurs applications : « il est important de résoudre les équations différentielles » selon la devise secrète de Newton. C’était vrai à la fondation de la mécanique céleste et de la physique moderne, c’est encore le cas aujourd’hui avec l’utilisation de modèles dont l’analyse relève souvent de la théorie des systèmes dynamiques (évolution d’une population, états d’un cristal…). <br \/><br \/> Si l’analyse fonctionnelle et l’analyse numérique étudient l’existence, l’unicité et les procédés d’approximation des solutions de tels modèles, la théorie des systèmes dynamiques cherche à en établir les propriétés à long terme (par exemple : prévisibilité statistique à long terme malgré l'imprévisibilité à moyen terme). <br \/><br \/> De façon moins évidente pour le néophyte, les systèmes dynamiques apparaissent également en mathématiques pures. Certains problèmes de géométrie et de théorie des nombres se traduisent ainsi élégamment et fructueusement en questions de dynamique. <br \/><br \/> L’ambition de ce cours est de présenter les notions de bases de la théorie moderne des systèmes dynamiques en lien avec quelques questions de géométrie et de théorie des nombres.<br \/><br \/> Programme <br \/><\/p><p style=\"text-align:justify;\"><\/p><p>Théorie ergodique : <br \/><\/p><p><\/p><ul><li> théorème de récurrence de Poincaré ; <\/li><li> notions d’irréductibilité : ergodicité, mélange, Bernoulli ; <\/li><li> théorèmes ergodiques  en moyenne et ponctuel. <\/li><li>Entropie mesurée ;<\/li><\/ul><p style=\"text-align:justify;\"> Dynamique topologique : <\/p><ul><li>théorème de récurrence de Birkhoff ; <\/li><li>notions d’irréductibilité : transitivité, mélange, minimalité ;<\/li><li>simplexe des mesures invariantes (unique ergodicité) ;<br \/><\/li><li>entropie topologique.<\/li><\/ul><p style=\"text-align:justify;\"> Théorie des nombres : <br \/><\/p><ul><li> développement en base entière et en fraction continue ; <\/li><li> équirépartition des valeurs de P(n), n décrivant les entiers et P étant un polynôme non constant ayant un coefficient irrationnel ;<\/li><li> Principe de correspondance de Furstenberg et théorème de Szemerédi.<\/li><\/ul><p>Dynamique des homéomorphismes du cercle :<\/p><ul><li>nombre de rotation ;<\/li><li>théorème et contre-exemple de Denjoy.<br \/><\/li><\/ul><p style=\"text-align:justify;\"><br \/> Dynamique des automorphismes hyperboliques linéaires du tore : <br \/><\/p><ul><li> sous-décalages de type finis ;<\/li><li>partition de Markov ; <\/li><li> entropie. <\/li><\/ul><p style=\"text-align:justify;\"><br \/><br \/><b>Niveau requis :<\/b> Les outils indispensables (en théorie de la mesure notamment) seront brièvement rappelés ou introduits. Une certaine familiarité avec les notions de base de la topologie sera un avantage.<br \/><br \/><b>Langue du cours :<\/b> Français<br \/><br \/><b>Credits ECTS :<\/b> 5<br \/><\/p>",
            "idnumber": "MAT551-2019"
        },
        {
            "code": "MEC430",
            "title": "MEC430 - Mécanique des milieux continus 1 (2019-2020)",
            "category": "Ingénieur 2A",
            "summary": "<p>L'enseignement présente les concepts fondamentaux de la Mécanique des milieux continus déformables dans le cadre simplifié des structures élancées. L’objectif est d’introduire tous les concepts dans ce cadre géométrique restreint afin d’arriver rapidement à des applications et de traiter de nombreux phénomènes avec un formalisme mathématique allégé.<br \/> La démarche suivie pour présenter les concepts sera celle sur laquelle s’appuiera la deuxième partie du cours de Mécanique des milieux continus (MEC431) pour décrire les structures tridimensionnelles : efforts intérieurs, efforts extérieurs, équations d’équilibre, conditions aux limites, déformations, lois de comportement et problèmes aux limites. <br \/> On s’intéressera ensuite à la résolution des problèmes obtenus et à la mise en évidence des phénomènes qui en découlent tant en statique qu’en dynamique, en petits qu’en grands déplacements.<\/p> <p>On étudiera ainsi les problèmes de statique de fils, de tiges, de poutres ou d’arcs élastiques ce qui permettra de traiter les problèmes classiques de la résistance des matériaux, de mettre en évidence des phénomènes d’instabilité comme le flambement ou d’aborder les questions de couches limites. <br \/> Enfin, on introduira l’approche variationnelle qui offre d’une part une autre vision des lois physiques qui gouvernent le comportement mécanique de telles structures, et qui fournit d’autre part des outils mathématiques et numériques pour traiter les équations. Ceci nous permettra en particulier d’obtenir des propriétés énergétiques fondamentales, de définir des concepts de stabilité et de faire une introduction à la méthode des éléments finis.<br \/><br \/>I. Les concepts généraux des milieux continus curvilignes<br \/> 1. Géométrie, déformation et cinématique<br \/> 2. Efforts extérieurs et intérieurs, conditions d'équilibre<br \/> 3. Lois de comportement<br \/><br \/> II. Statique des milieux continus curvilignes<br \/> 1. Problème aux limites<br \/> 2. Statique des fils, des tiges, des poutres et des arcs élastiques<br \/> 3. Formulation variationnelle, propriétés énergétiques et stabilité de l'équilibre<br \/><br \/><b>Niveau requis :<\/b> aucun<br \/><br \/><b>Modalités d'évaluation :<\/b> contrôle continu, examen final<br \/><br \/><b>Langue du cours :<\/b> Français<br \/><br \/><b>Credits ECTS :<\/b> 5<\/p>",
            "idnumber": "MEC430-2019"
        },
        {
            "code": "MEC431",
            "title": "MEC431 - Mécanique des milieux continus 2 (2019-2020)",
            "category": "Ingénieur 2A",
            "summary": "<p>L'enseignement présente les concepts fondamentaux de la Mécanique des milieux continus dans un cadre tridimensionnel général. La démarche, présentée dans la continuité du cours de MEC430, se concentre sur les notions de contraintes, lois de comportement, et écriture de problèmes stationnaires à échelle macroscopique. Il les met en œuvre sur des exemples simples essentiellement en Mécanique des solides. Il s'agit essentiellement de<br \/> - comprendre et savoir formaliser et manipuler les notions d’efforts intérieurs pour un milieu continu tridimensionnel. En particulier, savoir relier la formalisation par tenseur des contraintes de Cauchy à une interprétation micromécanique et savoir écrire et manipuler les équations du mouvement,<br \/> - découvrir la problématique de la déformabilité et  des lois de comportements et la mettre en œuvre sur quelques exemples réels,<br \/> - savoir poser un problème de mécanique en petites déformations et savoir en interpréter les résultats, y compris en terme de stabilité.<\/p> <p><\/p> <p>The course objectives are to give a basic knowledge of three dimensional continuum mechanics , its challenge and main concepts. Upon completion of the course, the student is expected to be familiar with the notions of strain and stress tensors, to be able to write and use the fundamental equations of motions in the framework of three dimensional continuum mechanics, to understand the problematic of constitutive laws and to solve elementary problems in fluid mechanics and in elasticity.<br \/><br \/> In continuation with the first part, the course introduces the general concepts of three dimensional Continuum Mechanics and implements them on simple examples. <br \/><br \/> It studies three dimensional continuum mechanics, strains and stresses under three aspects :<\/p><p><\/p> <ul type=\"disc\"><li>Macroscopic modelling of forces inside continuous media, introducing the different  stress tensors, and explaining what they physically represent and how they are used to express conservation laws, equilibrium equations and constitutive laws;<p><\/p><\/li> <li>Introduction of deformation, and of  basic constitutive laws with an emphasis on elasticity;<p><\/p><\/li> <li>Solution and possible stability analysis of steady state problems or equilibrium problems for simple three dimensional practical situations.<p><\/p><\/li> <\/ul><p><br \/> No prerequisite.<br \/><br \/><b>Requirements :<\/b> none, except a mathematical background in differential calculus and linear algebra. Continuum Mechanics 1 (MEC430) is advised. <\/p> <p><br \/><br \/><br \/><br \/><span style=\"text-decoration:underline;\"><b>Références bibliographiques :<\/b><\/span><\/p> <p>Notes de cours<br \/><b> <\/b><\/p> <ul><li><b>Modélisation et calcul des milieux continus <\/b> par Patrick Le Tallec (2009).<\/li> <\/ul><p><a href=\"http:\/\/imprimerie.polytechnique.fr\/CenterView.cfm?ID=3&amp;Table=Edition&amp;View=$&amp;BackURL=Table%3DEdition%26Departement%3DM%25E9canique\" target=\"_blank\" rel=\"noreferrer noopener\"> Ouvrage disponible auprès des <\/a><a href=\"http:\/\/imprimerie.polytechnique.fr\/EditionNew.cfm\" target=\"_blank\" rel=\"noreferrer noopener\">Editions de l'Ecole Polytechnique<\/a>.<br \/><br \/><b>Niveau requis :<\/b> une culture de base en mathématiques, en particulier en algèbre linéaire. Le cours de mécanique de milieux continus 1 (MEC430) est conseillé, mais pas obligatoire.<br \/><br \/><b>Modalités d'évaluation :<\/b> QCM, Contrôle continu, un projet, un examen final.<br \/><br \/><b>Dernière mise à jour :<\/b> mercredi 2 mai 2018<\/p>",
            "idnumber": "MEC431-2019"
        },
        {
            "code": "MEC432",
            "title": "MEC432 - Mécanique des fluides (2019-2020)",
            "category": "Ingénieur 2A",
            "summary": "<p><\/p><p>La mécanique des fluides se trouve au cœur de multiples applications dans le domaine de l’ingénierie ou de la recherche. Le cours vise à établir et à affermir les bases de cette discipline.Il est conçu pour s’adresser tant aux élèves qui désirent se limiter à l’obtention d’un bagage général et rigoureux sur le sujet, qu’aux élèves qui entrevoient de poursuivre l’année prochaine un ou plusieurs approfondissements dans cette spécialité.<br \/><br \/> Le cours de mécanique des fluides MEC432 pose les bases fondamentales de cette discipline. Le cours débute par une mise en perspective de la notion de fluide en regard de la physique et de la thermodynamique : qu’est-ce qui distingue un fluide d'un solide ? Qu'est-ce qui distingue les différents fluides ? Qu’est-ce qu’un fluide newtonien ? Nous déclinerons ensuite les principes fondamentaux de la cinématique des écoulements de fluides, puis ceux de la dynamique et de l’énergétique, pour aboutir aux équations fondamentales de la mécanique des fluides newtoniens : les équations de Navier-Stokes. Ces équations, bien que réputées parmi les plus ardues de la physique, sont quotidiennement analysées et calculées par les ingénieurs et les chercheurs. Nous présenterons alors les approximations qui facilitent cela, notamment celle du «fluide incompressible » et celle du « fluide parfait», en insistant sur leurs conditions physiques de validité. Nous étudierons ensuite comment l’on peut encore réduire le niveau de complexité de ces problèmes jusqu’à s’affranchir parfois de toute résolution mathématique, cela grâce à l’analyse dimensionnelle et aux principes de la similitude sur lesquels repose l’expérimentation en mécanique des fluides. Nous approfondirons alors l'approximation du fluide parfait qui fonde une grande partie des applications historiques de la mécanique des fluides. L’analyse des écoulements de fluide parfait met en relief le rôle particulier de la vorticité et nous nous explorerons alors la « dynamique de la vorticité » qui peut être considérée comme une discipline en soit. Puis nous montrerons comment l’approximation du fluide parfait peut être raccordée à une autre approximation qui concentre l'essentiel des effets de la viscosité, l'approximation de la couche limite, cela afin d'obtenir une description uniformément valable de tout écoulement. Enfin, nous terminerons ce cours par une introduction à la turbulence qui constitue aujourd'hui l’une des principales frontières de notre compréhension de la mécanique des fluides.<\/p><br \/><br \/><b>Niveau requis :<\/b> Aucun<br \/><b>Langue du cours :<\/b> Français<br \/><br \/><b>Credits ECTS :<\/b> 5<p><\/p>",
            "idnumber": "MEC432-2019"
        }
    ]
}